local auto_session = require("auto-session")


-- ============================================================================
-- Настройка автоматических сессий
-- ============================================================================


-- auto_session.setup({
--   auto_restore = true,                            -- Включаем автоматическое восстановление сессий
--   auto_session_suppress_dirs = {                  -- Исключаемые директории
--     "~/",
--     "~/Dev/",
--     "~/Downloads",
--     "~/Documents",
--     "~/Desktop/",
--   },
-- })


-- ============================================================================
-- Привязки клавиш для работы с сессиями
-- ============================================================================


local keymap = vim.keymap

keymap.set("n", "<leader>wr", "<cmd>SessionRestore<CR>", { desc = "Восстановить сессию" })
keymap.set("n", "<leader>ws", "<cmd>SessionSave<CR>", { desc = "Сохранить сессию" })
