colorizer = require("nvim-colorizer")


-- ============================================================================
-- Настройка плагина nvim-colorizer
-- ============================================================================


colorizer.setup({
  '*'                                         -- Активировать для всех файлов
}, {
  RGB      = true;                            -- Поддержка RGB цветов (например, #123)
  RRGGBB   = true;                            -- Поддержка RRGGBB цветов (например, #112233)
  names    = true;                            -- Поддержка именованных цветов (например, "red", "blue")
  RRGGBBAA = true;                            -- Поддержка цветов с альфа-каналом (например, #112233AA)
  mode     = 'background';                    -- Отображать цвета как фон
})
