local comment = require("Comment")
local ts_context_commentstring = require("ts_context_commentstring.integrations.comment_nvim")


-- ============================================================================
-- Настройка плагина комментирования comment
-- ============================================================================


-- Включить поддержку комментариев
comment.setup({
  pre_hook = ts_context_commentstring.create_pre_hook(), -- Для корректного комментирования tsx, jsx, svelte, html и др.
})


-- ============================================================================
-- Привязки клавиш для комментирования
-- ============================================================================


vim.keymap.set("n", "<F3>", "<cmd>Commentary<CR>", { desc = "Комментировать строку" })
vim.keymap.set("v", "<F3>", ":Commentary<CR>", { desc = "Комментировать выделение" })
