local keymap = vim.keymap
local map    = vim.api.nvim_set_keymap
local opts   = { noremap = true, silent = true }

vim.g.mapleader = " " -- Назначаем <leader> как пробел


-- ============================================================================
-- Навигация и буферы
-- ============================================================================


keymap.set("n", "<leader>nh", ":nohl<CR>", { desc = "Очистить подсветку поиска" })

-- Перемещение между буферами (вкладками)
keymap.set("n", "<Tab>",     "<cmd>bnext<CR>",   { desc = "Следующая вкладка" })
keymap.set("n", "<S-Tab>",   "<cmd>bNext<CR>",   { desc = "Предыдущая вкладка" })
keymap.set("n", "<leader>x", "<cmd>bdelete<CR>", { desc = "Закрыть текущую вкладку" })


-- ============================================================================
-- Управление окнами
-- ============================================================================


keymap.set("n", "<leader>sv", "<C-w>v | <cmd>bnext<CR>", { desc = "Вертикальное разделение окна" })
keymap.set("n", "<leader>sh", "<C-w>s | <cmd>bnext<CR>", { desc = "Горизонтальное разделение окна" })
keymap.set("n", "<leader>se", "<C-w>=", { desc = "Сделать окна одинакового размера" })
keymap.set("n", "<leader>sx", "<cmd>close<CR>", { desc = "Закрыть текущее окно" })


-- ============================================================================
-- Терминал
-- ============================================================================


map("n", "<leader>c", ":botright split | resize 15 | terminal<CR>", {
  noremap = true,
  silent = true,
  desc = "Открыть терминал"
})
map("t", "<Esc>",     [[<C-\><C-n>:bd!<CR>]], opts)


-- ============================================================================
-- Работа с отступами в визуальном режиме
-- ============================================================================


map("x", ">", ">gv", opts) -- Увеличить отступ
map("x", "<", "<gv", opts) -- Уменьшить отступ


-- ============================================================================
-- Прочее
-- ============================================================================


keymap.set("n", "<F8>", "<cmd>Tagbar<CR>", { desc = "Открыть Tagbar" })
keymap.set("n", "<leader>u", "<cmd>UndotreeToggle<CR>", { desc = "Открыть Undotree" })
