-- ============================================================================
-- Настройка плагина refactoring.nvim
-- ============================================================================


require('refactoring').setup({
  -- Включаем запрос типа возвращаемого значения функции для языков
  prompt_func_return_type = {
    go   = true,
    cpp  = true,
    c    = true,
    java = true,
    cs   = true, -- C#
  },

  -- Включаем запрос типа параметров функции для языков
  prompt_func_param_type = {
    go   = true,
    cpp  = true,
    c    = true,
    java = true,
    cs   = true, -- C#
  },

  printf_statements     = {}, -- Настройки для printf-выражений (оставлено пустым)
  print_var_statements  = {}, -- Настройки для отладки переменных (оставлено пустым)
})
