local todo_comments = require("todo-comments")


-- ============================================================================
-- Инициализация todo-comments с настройками по умолчанию
-- ============================================================================


todo_comments.setup()


-- ============================================================================
-- Привязки клавиш для навигации по комментариям TODO
-- ============================================================================


local keymap = vim.keymap -- Для краткости

keymap.set("n", "]t", function()
  todo_comments.jump_next()
end, { desc = "Следующий TODO комментарий" })

keymap.set("n", "[t", function()
  todo_comments.jump_prev()
end, { desc = "Предыдущий TODO комментарий" })
